INSERT INTO  t_mediator (i_mediator, x_mediator, x_mediator_phone, x_note)
  VALUES (11, 'Новикова Мария Васильевна', '-', 'ЦАО');
INSERT INTO  t_mediator (i_mediator, x_mediator, x_mediator_phone, x_note)
  VALUES (12, 'Халилова Вусало Мазахировна', '-', 'ЮВАО');
INSERT INTO  t_mediator (i_mediator, x_mediator, x_mediator_phone, x_note)
  VALUES (13, 'Бушева Алла Викторовна', '-', 'ЗАО');
INSERT INTO  t_mediator (i_mediator, x_mediator, x_mediator_phone, x_note)
  VALUES (14, 'Гаранина Валентина Сильвестровна', '-', 'все округа');

--01. Николаева Елена Николаевна ЦАО +7 (925) 007-01-50
--02. Кильдишев Александр Сергеевич САО +7 (925) 007-01-57
--03. Жаренова Елена Алексеевна СВАО +7 (925) 007-01-58
--04. Яблочник Евгений Александрович ВАО +7 (925) 007-01-51
--05. Соломатин Сергей Юрьевич ЮВАО +7 (925) 007-01-52
--06. Рогов Илья Евгеньевич ЮАО +7 (925) 007-01-53
--07. Цветков Александр Юрьевич ЮЗАО +7 (925) 007-01-54
--08. Чячяков Рустам Халилович ЗАО +7 (925) 007-01-55
--09. Лутфуллин Алексей Владимирович СЗАО +7 (925) 007-01-56
--10. Курцева Ирина Сергеевна ЗЕЛЕНОГРАД +7 (925) 007-01-59
--11. Новикова Мария Васильевна ЦАО
--12. Халилова Вусало Мазахировна ЮВАО
--13. Бушева Алла Викторовна ЗАО
--14. Гаранина Валентина Сильвестровна все

--01 - ЦАО
--02 - САО
--03 - СВАО
--04 - ВАО
--05 - ЮВАО
--06 - ЮАО
--07 - ЮЗАО
--08 - ЗАО
--09 - СЗАО
--10 - ЗелАО